/**
 * @file SimpleConfig.hpp
 * @brief Конфигурация для простой задачи оптимизации
 */

#pragma once
#include <vector>
#include "base_config.hpp"


struct SimpleConfig : public BaseConfig {
    // ===== СПЕЦИФИЧНЫЕ ПАРАМЕТРЫ ЭТОЙ ЗАДАЧИ =====
    
    /// Начало диапазона оценки
    float x_start = 0.0f;
    
    /// Шаг дискретизации
    float x_step = 0.2f;
    
    /// Количество точек для оценки
    int num_samples = 1000;
    
    /// Параметр целевой функции q
    float free_param = 2.5f;
    
    
    // ===== ИНИЦИАЛИЗАЦИЯ =====
    
    SimpleConfig() {
        // Инициализируем базовую матрицу
        base_matrix = {
            {0, 0, 0, 0, 0, 1, 1, 26, 0, 2, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 1, 0, 2, 0, 0, 0, 0, 0},
            {0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
            {0, 0, 0, 0, 4, 0, 0, 3, 0, 22, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 12},
            {0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 16, 0},
            {0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 8, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 1, 14, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 0, 0, 1, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 0, 11, 8},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 13},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 18},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1}
        };
        
        base_params = {0., 0.};
        
        nodes_for_vars = {0};
        nodes_for_params = {1, 2};
        nodes_for_output = {13};
    }
};
